import 'package:flutter/material.dart';

class Words{
  final List<String> foodList = [
    '라면',
    '김밥',
    '떡볶이',
    '햄버거',
    '피자',
    '핫도그',
    '치킨',
    '초밥',
    '샌드위치',
    '아이스크림',
    '빵',
    '과자',
    '주스',
    '스파게티',
    '샐러드',
    '스테이크',
    '감자튀김',
    '수박',
    '사과',
    '바나나',
    '김치',
    '된장찌개',
    '비빔밥',
    '불고기',
    '갈비',
    '삼겹살',
    '잡채',
    '갈비탕',
    '감자전',
    '전복죽',
    '오징어볶음',
    '호떡',
    '순대',
    '해물파전',
    '닭갈비',
    '족발',
    '보쌈',
    '곰탕',
    '설렁탕',
    '칼국수',
    '타코',
    '파에야',
    '토르티야',
    '파스타',
    '라자냐',
    '치즈버거',
    '크로와상',
    '감바스',
    '케밥',
    '샤오롱바오',
    '스시',
    '카레',
    '팟타이',
    '초코 퐁듀',
    '햄치즈오믈렛',
    '오코노미야끼',
    '양꼬치',
    '스콘',
    '핫초콜릿',
    '비프 웰링턴',
    '마카롱',
    '와플',
    '도넛',
    '초콜릿',
    '푸딩',
    '젤리',
    '크레이프',
    '팥빙수',
    '에클레어',
    '카스테라',
    '쿠키',
    '케이크',
    '머핀',
    '티라미수',
    '츄러스',
    '파운드케이크',
    '수플레',
    '아이스크림 콘',
    '호두파이',
    '모나카',
    '커피',
    '녹차',
    '라떼',
    '버블티',
    '생강차',
    '망고스무디',
    '칵테일',
    '레모네이드',
    '딸기우유',
    '맥주',
    '와인',
    '사과주스',
    '코코넛워터',
    '에스프레소',
    '밀크셰이크',
    '자몽에이드',
    '스무디볼',
    '카푸치노',
    '코코아',
    '에이드',
  ];
  final List<String> plantList = ["사시 나무", "오동 나무", "카카오 나무"];
  final List<String> animalList = ["개", "고양이", "나무늘보"];

  List<String> returnSubjectList(String subject) {
    if (subject == "food") {
      return foodList;
    } else if (subject == "plant") {
      return plantList;
    } else{
      return animalList;
    }
  }







}
